
#### Terraform Format 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.mine_server_rg: Reading...
data.azurerm_resource_group.mine_server_rg: Read complete after 0s [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg]
data.azurerm_storage_account.mine_server_storage: Reading...
data.azurerm_storage_account.mine_server_storage: Read complete after 1s [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.Storage/storageAccounts/mineserversa]
azurerm_storage_share.mine_file_share: Refreshing state... [id=https://mineserversa.file.core.windows.net/mineserverfileshare]
azurerm_container_group.mine_server: Refreshing state... [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.ContainerInstance/containerGroups/mine-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_public_ip.mine_lb_public_ip will be created
  + resource "azurerm_public_ip" "mine_lb_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "brazilsouth"
      + name                    = "mine-lb-public-ip"
      + resource_group_name     = "mine-server-rg"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mfollypp, Action: `pull_request`, Workflow: `Terraform`*